---
kind: type
id: T:Autodesk.Revit.DB.Structure.AnalyticalOpening
source: html/201af27b-c908-83b6-19f2-23d5fa9b69ed.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalOpening

An element that represents an Opening in an Analytical Panel element.

## Syntax (C#)
```csharp
public class AnalyticalOpening : AnalyticalSurfaceBase
```

## Remarks
It can cut only one Analytical Panel at a time.